{
  "app": {
    "fieldJobRole": "Software Engineer",
    "aboutMeHeader": "About me",
    "coursesHeader": "Completed Courses and trainings",
    "employmentHistoryHeader": "Employment history",
    "educationHeader": "Education",
    "portfolioHeader": "Portfolio",
    "pageTitle": "Tomasz Wąsacz - Software Engineer",
    "allRightsReserved": "All rights reserved."
  },
  "month": {
    "jan": "January",
    "feb": "February",
    "mar": "March",
    "apr": "April",
    "may": "May",
    "jun": "June",
    "jul": "July",
    "aug": "August",
    "sep": "September",
    "oct": "October",
    "nov": "November",
    "dec": "December"
  },
  "aboutMe": {
    "firstParagraph": "Since 2020, I've been professionally programming in Java (Spring) and JavaScript/TypeScript (React)."
  },
  "skills": {
    "strengthsSubheader": "Strengths",
    "certificationsSubheader": "Training Completed",
    "technologiesSubheader": "Learned Technologies",
    "strengths": {
      "webApplicationDeveloper": {
        "header": "Web Application Developer",
        "description": "I create web applications by combining frontend and backend. I design user interfaces and implement business logic, ensuring interactivity and responsiveness. I have experience with architectures based on both synchronous and asynchronous communication."
      },
      "qualityDrivenDeveloper": {
        "header": "Quality-Driven Developer",
        "description": "In order to ensure high code quality and reduce the number of emerging errors, I ensure that applications are well-tested using unit and integration tests. Thanks to this approach, the applications I work on are more reliable and easier to maintain."
      },
      "cleanCodePractitioner": {
        "header": "Clean Code Practitioner",
        "description": "I write clear and understandable code, adhering to the best programming practices. Throughout my career, I always strive to follow practices such as SOLID, KISS, DRY, YAGNI, as well as many other good practices advocated by Uncle Bob (Bob Martin)"
      },
      "refactoringNinja": {
        "header": "Refactoring Ninja",
        "description": "I specialize in improving existing code, removing unnecessary elements, and optimizing its structure, ensuring its readability and efficiency. Following the theory of broken windows, I strive to prevent 'broken windows' from occurring."
      },
      "architectureEnthusiast": {
        "header": "Architecture Enthusiast",
        "description": "I am passionate about computer system architecture and I aim to delve into the intricacies of software design, creating scalable, efficient, and flexible systems using Domain-Driven Design (DDD) practices."
      }
    }
  },
  "courses": {
    "courseNameLabel": "Course",
    "authorNameLabel": "Author/s",
    "platformNameLabel": "Platform",
    "dateOfCompletionLabel": "Date of completion",
    "courseDetails": "Course details"
  },
  "employmenthistory": {
    "current": "current",
    "cornerstone": {
      "softwareengineer": {
        "resp1": "Designing, developing, and maintaining the TalentLink application supporting the recruitment process.",
        "resp2": "Full responsibility for both the frontend and backend parts of the application.",
        "resp3": "Collaborating with the team to improve the 'candidate facing' system area and rewriting part of the system related to career pages.",
        "resp4": "Utilizing CI/CD tools to ensure continuity, quality, and efficiency in the development process.",
        "resp5": "Actively participating in UI design and collaborating with the product team and UX team."
      },
      "juniorsoftwareengineer": {
        "resp1": "Actively participating in designing and developing the TalentLink application, supporting the recruitment process.",
        "resp2": "Responsibility for both the frontend and backend parts of the application.",
        "resp3": "Collaborating with the team to improve the 'candidate facing' system area and rewriting part of the system related to career pages.",
        "resp4": "Experience in ensuring website compliance with WCAG standards, ensuring accessibility and usability for users with various needs.",
        "resp5": "Active participation in team meetings regarding project planning and application development strategies."
      },
      "internsoftwaredeveloper": {
        "resp1": "Applying skills acquired during studies to practical software development.",
        "resp2": "Active usage of Java and React for application development, and utilizing Git version control system.",
        "resp3": "Understanding synchronous communication in REST architecture and writing unit tests.",
        "resp4": "Participating in teamwork following Agile methodology and using Atlassian software for project management.",
        "resp5": "Developing analytical skills and problem-solving abilities through practical projects."
      }
    },
    "i2b": {
      "itspecialist": {
        "resp1": "Managed both Linux and Windows environments.",
        "resp2": "Oversaw the call center software, including the Hermes system, and its MSSQL database.",
        "resp3": "Managed network and teleinformatics infrastructure.",
        "resp4": "Created and administered domains using tools like Samba and QNAP NAS server.",
        "resp5": "Developed scripts tailored to client needs, particularly focusing on call center solutions.",
        "resp6": "Supervised access security to resources and managed user groups.",
        "resp7": "Implemented and maintained the ESET antivirus system.",
        "resp8": "Managed and monitored the Fortigate network firewall.",
        "resp9": "Utilized programming languages such as PHP and Bash to automate repetitive tasks.",
        "resp10": "Developed tools to streamline daily work processes for clients."
      }
    }
  },
  "education": {
    "pk": {
      "name": "Cracow University of Technology",
      "title": "Bachelor of Engineering, Computer Science",
      "description": {
        "paragraph1": "During my studies, I had the opportunity to delve into various aspects of computer science, including <strong>software design, computer networks, databases, and algorithms</strong>. I participated in numerous team projects, which allowed me to develop collaboration skills and problem-solving abilities within a group. Working in a team on various IT projects enriched my experience.",
        "paragraph2": "As part of my diploma thesis, I developed an application for <strong>managing household finances</strong>. The project included the implementation of the user interface and application logic, along with comprehensive infrastructure. The diploma thesis was supplemented with detailed documentation, which thoroughly describes all aspects of the application and its creation process.",
        "paragraph3": "Additionally, throughout my academic journey, I had the honor of receiving the <strong>rector's scholarship for top students</strong>."
      }
    },
    "zse": {
      "name": "Zespół Szkół Elektronicznych; Technikum no. 6",
      "title": "Technician of Computer Science",
      "description": {
        "paragraph1": "During my studies, I obtained three qualifications:",
        "e12": "Assembly and operation of personal computers and peripheral devices,",
        "e13": "Designing local computer networks and network administration,",
        "e14": "Creating web applications and databases and administering them,",
        "paragraph2": "Throughout my studies, I received a scholarship under the <strong>'Young Engineer'</strong> program."
      }
    }
  }
}