{
  "app": {
    "fieldJobRole": "Software Engineer",
    "aboutMeHeader": "About me",
    "skillsHeader": "Skills",
    "employmentHistoryHeader": "Employment history",
    "educationHeader": "Education",
    "portfolioHeader": "Portfolio",
    "pageTitle": "Tomasz Wąsacz - Software Engineer"
  },
  "month": {
    "jan": "January",
    "feb": "February",
    "mar": "March",
    "apr": "April",
    "may": "May",
    "jun": "June",
    "jul": "July",
    "aug": "August",
    "sep": "September",
    "oct": "October",
    "nov": "November",
    "dec": "December"
  },
  "aboutMe": {
    "firstParagraph": "I am a software engineer, professionally involved in the field since 2020. My expertise lies in languages such as Java (leveraging the Spring framework) and JavaScript/TypeScript (employing the React framework). I am committed to the meticulous craft of clean code and the rigorous application of best programming practices.",
    "secondParagraph": "Throughout my career, I have cultivated a profound appreciation for the art of programming and remain dedicated to advancing my skills in delivering robust and elegant software solutions."
  },
  "skills": {
    "strengthsSubheader": "Strengths",
    "certificationsSubheader": "Training Completed",
    "technologiesSubheader": "Learned Technologies",
    "strengths": {
      "webApplicationDeveloper": {
        "header": "Web Application Developer",
        "description": "I develop web applications, integrating frontend and backend. I design user interfaces and implement business logic, ensuring interactivity and responsiveness."
      },
      "qualityDrivenDeveloper": {
        "header": "Quality-Driven Developer",
        "description": "I write clear, understandable, and elegant code, following the best programming practices. I focus on modularity and readability."
      },
      "cleanCodePractitioner": {
        "header": "Clean Code Practitioner",
        "description": "I write clear, understandable, and elegant code, following the best programming practices. I focus on modularity and readability, applying practices such as SOLID, KISS, DRY, YAGNI, etc."
      },
      "refactoringNinja": {
        "header": "Refactoring Ninja",
        "description": "I specialize in improving existing code, removing unnecessary elements, and optimizing its structure, ensuring readability and performance."
      },
      "architectureEnthusiast": {
        "header": "Architecture Enthusiast",
        "description": "I'm passionate about the architecture of information systems. I strive to delve into the secrets of software design and create scalable, efficient, and flexible systems."
      }
    }
  },
  "courses": {
    "courseNameLabel": "Course",
    "authorNameLabel": "Author/s",
    "platformNameLabel": "Platform",
    "dateOfCompletionLabel": "Date of completion",
    "courseDetails": "Course details"
  },
  "employmenthistory": {
    "current": "current",
    "cornerstone": {
      "softwareengineer": {
        "resp1": "Designing, developing, and maintaining the TalentLink application supporting the recruitment process.",
        "resp2": "Full responsibility for both the frontend and backend parts of the application.",
        "resp3": "Collaborating with the team to improve the 'candidate facing' system area and rewriting part of the system related to career pages.",
        "resp4": "Utilizing CI/CD tools to ensure continuity, quality, and efficiency in the development process.",
        "resp5": "Actively participating in UI design and collaborating with the product team and UX team."
      },
      "juniorsoftwareengineer": {
        "resp1": "Actively participating in designing and developing the TalentLink application, supporting the recruitment process.",
        "resp2": "Responsibility for both the frontend and backend parts of the application.",
        "resp3": "Collaborating with the team to improve the 'candidate facing' system area and rewriting part of the system related to career pages.",
        "resp4": "Experience in ensuring website compliance with WCAG standards, ensuring accessibility and usability for users with various needs.",
        "resp5": "Active participation in team meetings regarding project planning and application development strategies."
      },
      "internsoftwaredeveloper": {
        "resp1": "Applying skills acquired during studies to practical software development.",
        "resp2": "Active usage of Java and React for application development, and utilizing Git version control system.",
        "resp3": "Understanding synchronous communication in REST architecture and writing unit tests.",
        "resp4": "Participating in teamwork following Agile methodology and using Atlassian software for project management.",
        "resp5": "Developing analytical skills and problem-solving abilities through practical projects."
      }
    },
    "i2b": {
      "itspecialist": {
        "resp1": "Managed both Linux and Windows environments.",
        "resp2": "Oversaw the call center software, including the Hermes system, and its MSSQL database.",
        "resp3": "Managed network and teleinformatics infrastructure.",
        "resp4": "Created and administered domains using tools like Samba and QNAP NAS server.",
        "resp5": "Developed scripts tailored to client needs, particularly focusing on call center solutions.",
        "resp6": "Supervised access security to resources and managed user groups.",
        "resp7": "Implemented and maintained the ESET antivirus system.",
        "resp8": "Managed and monitored the Fortigate network firewall.",
        "resp9": "Utilized programming languages such as PHP and Bash to automate repetitive tasks.",
        "resp10": "Developed tools to streamline daily work processes for clients."
      }
    }
  }
}