{
  "app": {
    "fieldJobRole": "Inżynier Oprogramowania",
    "aboutMeHeader": "O mnie",
    "coursesHeader": "Odbyte szkolenia i kursy",
    "employmentHistoryHeader": "Historia zatrudnienia",
    "educationHeader": "Edukacja",
    "portfolioHeader": "Portfolio",
    "pageTitle": "Tomasz Wąsacz - Inżynier Oprogramowania"
  },
  "month": {
    "jan": "Styczeń",
    "feb": "Luty",
    "mar": "Marzec",
    "apr": "Kwiecień",
    "may": "Maj",
    "jun": "Czerwiec",
    "jul": "Lipiec",
    "aug": "Sierpień",
    "sep": "Wrzesień",
    "oct": "Październik",
    "nov": "Listopad",
    "dec": "Grudzień"
  },
  "aboutMe": {
    "firstParagraph": "Od 2020 roku profesjonalnie programuję w Java (Spring) i JavaScript/TypeScript (React)."
  },
  "skills": {
    "strengthsSubheader": "Mocne strony",
    "certificationsSubheader": "Odbyte szkolenia",
    "technologiesSubheader": "Poznane technologie",
    "strengths": {
      "webApplicationDeveloper": {
        "header": "Programista aplikacji webowych",
        "description": "Tworzę aplikacje internetowe, łącząc frontend i backend. Projektuję interfejsy użytkownika i implementuję logikę biznesową, dbając o interaktywność i responsywność. Mam doświadczenie z architekturami opartymi o komunikacje synchroniczną oraz asynchroniczną. "
      },
      "qualityDrivenDeveloper": {
        "header": "Programista dbający o jakość",
        "description": "Aby zapewnić wysoką jakość kodu i ograniczać liczbę powstających błędów, dbam o to by, aplikacje były dobrze przetestowane za pomocą testów jednostkowych i integracyjnych. Dzięki temu podejściu, aplikacje przy których pracuje są mniej zawodne i łatwiejsze w utrzymaniu."
      },
      "cleanCodePractitioner": {
        "header": "Fan czystego kodu",
        "description": "Piszę czytelny i zrozumiały kod, stosując najlepsze praktyki programistyczne. W czasie swojej zawsze staram się kierować praktykami takimi jak: SOLID, KISS, DRY, YAGNI, a także wielu innym dobrym praktykom propagowanymi między innymi przez Wujka Boba (Bob Martin)."
      },
      "refactoringNinja": {
        "header": "Ninja Refaktoru",
        "description": "Specjalizuję się w poprawianiu istniejącego kodu, usuwaniu zbędnych elementów i optymalizacji struktury, zapewniając jego czytelność i wydajność. Zgodnie z teorią rozbitych szyb, staram się zapobiegać \"wybitym oknom\"."
      },
      "architectureEnthusiast": {
        "header": "Entuzjasta Architektury",
        "description": "Jestem pasjonatem architektury systemów informatycznych, chcę zgłębiać tajniki projektowania oprogramowania i tworzyć skalowalne, wydajne i elastyczne systemy z wykorzystaniem praktyk Domain-Driven Design (DDD)."
      }
    }
  },
  "courses": {
    "courseNameLabel": "Szkolenie",
    "authorNameLabel": "Autor/Autorzy",
    "platformNameLabel": "Platforma",
    "dateOfCompletionLabel": "Data ukończenia",
    "courseDetails": "Szczegóły szkolenia"
  },
  "employmenthistory": {
    "current": "obecnie",
    "cornerstone": {
      "softwareengineer": {
        "resp1": "Projektowanie, rozwijanie i utrzymywanie aplikacji TalentLink wspierającej proces rekrutacji.",
        "resp2": "Pełna odpowiedzialność za zarówno część frontendową, jak i backendową aplikacji.",
        "resp3": "Współpraca z zespołem w doskonaleniu obszaru 'candidate facing' systemu oraz przepisanie części systemu dotyczącej stron kariery.",
        "resp4": "Wykorzystanie narzędzi do CI/CD dla zapewnienia ciągłości, jakości i efektywności procesu deweloperskiego.",
        "resp5": "Aktywny udział w projektowaniu interfejsu użytkownika i współpraca z zespołem ds. produktu oraz projektantami UX."
      },
      "juniorsoftwareengineer": {
        "resp1": "Aktywne uczestnictwo w projektowaniu i rozwijaniu aplikacji TalentLink, wspierającej proces rekrutacji.",
        "resp2": "Odpowiedzialność za część frontendową i backendową aplikacji.",
        "resp3": "Współpraca z zespołem w doskonaleniu obszaru 'candidate facing' systemu oraz przepisanie części systemu dotyczącej stron kariery.",
        "resp4": "Doświadczenie w zapewnianiu zgodności stron internetowych z normami WCAG, dbając o dostępność i użyteczność dla użytkowników z różnymi potrzebami.",
        "resp5": "Aktywne udział w spotkaniach zespołowych dotyczących planowania projektów i strategii rozwoju aplikacji."
      },
      "internsoftwaredeveloper": {
        "resp1": "Zastosowanie umiejętności zdobytych podczas nauki do praktycznego tworzenia oprogramowania.",
        "resp2": "Aktywne działanie z językami programowania Java i React do rozwijania aplikacji oraz stosowanie systemu kontroli wersji Git.",
        "resp3": "Zrozumienie synchronicznej komunikacji w architekturze REST i pisanie testów jednostkowych.",
        "resp4": "Uczestnictwo w pracy zespołowej zgodnie z metodyką Agile i wykorzystanie oprogramowania Atlassian do zarządzania projektami.",
        "resp5": "Rozwój zdolności analitycznych i umiejętności rozwiązywania problemów poprzez praktyczne projekty."
      }
    },
    "i2b": {
      "itspecialist": {
        "resp1": "Zarządzanie środowiskami Linux i Windows.",
        "resp2": "Nadzór nad oprogramowaniem centrum obsługi, w tym systemem Hermes i jego bazą danych MSSQL.",
        "resp3": "Zarządzanie infrastrukturą sieciową i teleinformatyczną.",
        "resp4": "Tworzenie i administrowanie domenami przy użyciu narzędzi takich jak Samba i serwer QNAP NAS.",
        "resp5": "Rozwój skryptów dostosowanych do potrzeb klientów, ze szczególnym uwzględnieniem rozwiązań dla centrów obsługi.",
        "resp6": "Nadzór nad bezpieczeństwem dostępu do zasobów i zarządzanie grupami użytkowników.",
        "resp7": "Wdrożenie i utrzymanie systemu antywirusowego ESET.",
        "resp8": "Zarządzanie i monitorowanie zapory sieciowej Fortigate.",
        "resp9": "Wykorzystanie języków programowania, takich jak PHP i Bash, do automatyzacji powtarzalnych zadań.",
        "resp10": "Rozwój narzędzi usprawniających codzienną pracę klientów."
      }
    }
  }
}