{
  "app": {
    "fieldJobRole": "Inżynier Oprogramowania",
    "aboutMeHeader": "O mnie",
    "skillsHeader": "Umiejętności",
    "employmentHistoryHeader": "Historia zatrudnienia",
    "educationHeader": "Edukacja",
    "portfolioHeader": "Portfolio",
    "pageTitle": "Tomasz Wąsacz - Inżynier Oprogramowania"
  },
  "month": {
    "jan": "Styczeń",
    "feb": "Luty",
    "mar": "Marzec",
    "apr": "Kwiecień",
    "may": "Maj",
    "jun": "Czerwiec",
    "jul": "Lipiec",
    "aug": "Sierpień",
    "sep": "Wrzesień",
    "oct": "Październik",
    "nov": "Listopad",
    "dec": "Grudzień"
  },
  "aboutMe": {
    "firstParagraph": "Jestem inżynierem oprogramowania, zawodowo zajmuję się tym od 2020 roku. Specjalizuję się w takich językach jak Java (z wykorzystaniem frameworka Spring) oraz JavaScript/TypeScript (z wykorzystaniem frameworka React). Moją pasją jest tworzenie czystego kodu i przestrzeganie najlepszych praktyk programistycznych.",
    "secondParagraph": "W trakcie mojej pracy, odkryłem prawdziwą pasję do programowania i staram się doskonalić moje umiejętności by tworzyć dopasowane do oczekiwań rozwiązania."
  },
  "skills": {
    "strengthsSubheader": "Mocne strony",
    "certificationsSubheader": "Odbyte szkolenia",
    "technologiesSubheader": "Poznane technologie",
    "strengths": {
      "webApplicationDeveloper": {
        "header": "Programista aplikacji webowych",
        "description": "Tworzę aplikacje internetowe, łącząc frontend i backend. Projektuję interfejsy użytkownika i implementuję logikę biznesową, dbając o interaktywność i responsywność."
      },
      "qualityDrivenDeveloper": {
        "header": "Programista dbający o jakość",
        "description": "Regularnie piszę testy jednostkowe oraz integracyjne, aby zapewnić wysoką jakość kodu i ograniczać liczbę powstających błędów. Dzięki temu podejściu, aplikacje przy których pracuje są niezawodne i łatwiejsze w utrzymaniu."
      },
      "cleanCodePractitioner": {
        "header": "Fan czystego kodu",
        "description": "Piszę czytelny, zrozumiały i elegancki kod, stosując najlepsze praktyki programistyczne. Dbam o modularność i czytelność kodu, stosując praktyki: SOLID, KISS, DRY, YAGNI itp."
      },
      "refactoringNinja": {
        "header": "Ninja Refaktoru",
        "description": "Specjalizuję się w poprawianiu istniejącego kodu, usuwaniu zbędnych elementów i optymalizacji struktury, zapewniając jego czytelność i wydajność. Nie lubię zostawiać wybitych okien"
      },
      "architectureEnthusiast": {
        "header": "Entuzjasta Architektury",
        "description": "Jestem pasjonatem architektury systemów informatycznych, chcę zgłębiać tajniki projektowania oprogramowania i tworzyć skalowalne, wydajne i elastyczne systemy."
      }
    }
  },
  "courses": {
    "courseNameLabel": "Szkolenie",
    "authorNameLabel": "Autor/Autorzy",
    "platformNameLabel": "Platforma",
    "dateOfCompletionLabel": "Data ukończenia"
  }
}